{"weightsManifest": [{"paths": ["group1-shard1of23", "group1-shard2of23", "group1-shard3of23", "group1-shard4of23", "group1-shard5of23", "group1-shard6of23", "group1-shard7of23", "group1-shard8of23", "group1-shard9of23", "group1-shard10of23", "group1-shard11of23", "group1-shard12of23", "group1-shard13of23", "group1-shard14of23", "group1-shard15of23", "group1-shard16of23", "group1-shard17of23", "group1-shard18of23", "group1-shard19of23", "group1-shard20of23", "group1-shard21of23", "group1-shard22of23", "group1-shard23of23"], "weights": [{"dtype": "float32", "shape": [256], "name": "bn2a_branch1/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch1/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/beta"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn2c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/beta"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn2c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch1/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2a/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/gamma"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/beta"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "bn3d_branch2b/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/beta"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn3d_branch2c/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch1/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4d_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4d_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4e_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4e_branch2c/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2a/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/gamma"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/beta"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "bn4f_branch2b/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/gamma"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/beta"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "bn4f_branch2c/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch1/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5a_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5a_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5b_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5b_branch2c/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2a/moving_variance"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/gamma"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/beta"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/moving_mean"}, {"dtype": "float32", "shape": [512], "name": "bn5c_branch2b/moving_variance"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/gamma"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/beta"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "bn5c_branch2c/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/gamma"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/beta"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "bn_conv1/moving_variance"}, {"dtype": "float32", "shape": [7, 7, 3, 64], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch1/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "res2a_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2a_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2b_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2b_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2b_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2c_branch2a/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2c_branch2b/kernel"}, {"dtype": "float32", "shape": [64], "name": "res2c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2c_branch2c/kernel"}, {"dtype": "float32", "shape": [256], "name": "res2c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "res3a_branch1/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "res3a_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3a_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3a_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3c_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3c_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3c_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3d_branch2a/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3d_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3d_branch2b/kernel"}, {"dtype": "float32", "shape": [128], "name": "res3d_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3d_branch2c/kernel"}, {"dtype": "float32", "shape": [512], "name": "res3d_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "res4a_branch1/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "res4a_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4a_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4a_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4c_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4c_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4c_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4c_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4d_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4d_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4d_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4d_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4d_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4d_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4e_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4e_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4e_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4e_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4e_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4e_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4f_branch2a/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4f_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4f_branch2b/kernel"}, {"dtype": "float32", "shape": [256], "name": "res4f_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4f_branch2c/kernel"}, {"dtype": "float32", "shape": [1024], "name": "res4f_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 2048], "name": "res5a_branch1/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5a_branch1/bias"}, {"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "res5a_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5a_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5a_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5a_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5a_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5a_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5b_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5b_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5b_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5b_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5b_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5b_branch2c/bias"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5c_branch2a/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5c_branch2a/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5c_branch2b/kernel"}, {"dtype": "float32", "shape": [512], "name": "res5c_branch2b/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5c_branch2c/kernel"}, {"dtype": "float32", "shape": [2048], "name": "res5c_branch2c/bias"}, {"dtype": "float32", "shape": [2048, 2], "name": "softmax/kernel"}, {"dtype": "float32", "shape": [2], "name": "softmax/bias"}]}], "modelTopology": {"training_config": {"loss_weights": null, "loss": "categorical_crossentropy", "sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "lr": 9.999999747378752e-06, "amsgrad": false, "decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033}}}, "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "conv1", "dtype": "float32", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "padding": "same"}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn_conv1", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn_conv1"}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation"}, "name": "activation"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dtype": "float32", "pool_size": [3, 3], "name": "max_pooling2d", "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2a_branch2a", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2a_branch2a"}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2a_branch2a", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2a_branch2a"}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2a_branch2b", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "name": "res2a_branch2b"}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2a_branch2b", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2a_branch2b"}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2a_branch2c", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2a_branch2c"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2a_branch1", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2a_branch1"}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2a_branch2c", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2a_branch2c"}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2a_branch1", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2a_branch1"}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add"}, "name": "add"}, {"inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2b_branch2a", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2b_branch2a"}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2b_branch2a", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2b_branch2a"}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2b_branch2b", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "name": "res2b_branch2b"}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2b_branch2b", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2b_branch2b"}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2b_branch2c", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2b_branch2c"}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2b_branch2c", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2b_branch2c"}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_3", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2c_branch2a", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2c_branch2a"}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2c_branch2a", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2c_branch2a"}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2c_branch2b", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "name": "res2c_branch2b"}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2c_branch2b", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2c_branch2b"}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res2c_branch2c", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res2c_branch2c"}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn2c_branch2c", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn2c_branch2c"}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res3a_branch2a", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "filters": 128, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res3a_branch2a"}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn3a_branch2a", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn3a_branch2a"}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res3a_branch2b", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "name": "res3a_branch2b"}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn3a_branch2b", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn3a_branch2b"}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res3a_branch2c", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res3a_branch2c"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res3a_branch1", "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "strides": [2, 2], "data_format": "channels_last", "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_size": [1, 1], "padding": "valid"}, "name": "res3a_branch1"}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn3a_branch2c", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn3a_branch2c"}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "bn3a_branch1", "beta_constraint": null, "momentum": 0.99, "scale": true, "center": true, "dtype": "float32", "axis": [3], "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "trainable": true, "epsilon": 0.001}, "name": "bn3a_branch1"}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "config": {"dtype": "float32", "trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "res3b_branch2a", "dtype": "float32", "trainable": true, 